// Preflight
"DISK_FULL_TITLE" = "Your hard disk does not have enough space.";
"DISK_FULL_FOR_DOWNLOAD_STATUS" = "You need %@ of available space to download the updates. To increase available space, remove files from your hard disk, and then try again.";
"DISK_FULL_FOR_DOWNLOAD_AND_INSTALL_STATUS" = "You need %@ of available space to download and install the updates. To increase available space, remove files from your startup disk, and then try again.";

// AC power check
"CONFIRM_NO_POWER_ADAPTER_TITLE" = "Your computer is not connected to a power source.";
"CONFIRM_NO_POWER_ADAPTER_MESSAGE" = "For best results, you should connect your computer to a power source before installing. Are you sure you want to continue the installation?";
"CONTINUE_TITLE" = "Continue";

"CANCEL_TITLE" = "Cancel";

// Session error
"UPDATE_DOWNLOAD_ERROR" = "The update “%@” can’t be saved.";
"NONE_CHECKED_DOWNLOAD_ERROR" = "None of the selected updates could be saved.";
"SOME_CHECKED_DOWNLOAD_ERROR" = "Some of the selected updates couldn't be saved.";

"UPDATE_INSTALL_ERROR" = "The update “%@” can’t be installed.";
"NONE_CHECKED_INSTALL_ERROR" = "None of the selected updates could be installed.";
"SOME_CHECKED_INSTALL_ERROR" = "Some of the selected updates couldn't be installed.";

"OK_TITLE" = "OK";

// Pre-session error
"UPDATE_NOT_FOUND_ERROR" = "The update can’t be installed.";

// 3B) Updated downloaded, time to logout and install
"UPDATES_DOWNLOADED_INSTALL_AND_LOGOUT_MESSAGE" = "To install the updates, you must log out.";
"UPDATES_DOWNLOADED_INSTALL_AND_LOGOUT_INFORMATIVE" = "To finish the installation and log out, click Log Out.";
"LOG_OUT_AND_INSTALL_TITLE" = "Log Out";

"UPDATES_DOWNLOADED_INSTALL_AND_RESTART_MESSAGE" = "To install the updates, you must restart your computer.";
"UPDATES_DOWNLOADED_INSTALL_AND_RESTART_INFORMATIVE" = "To finish the installation and restart your computer, click Restart.";
"LOG_OUT_AND_INSTALL_AND_RESTART_TITLE" = "Restart";

"UPDATES_DOWNLOADED_INSTALL_AND_SHUTDOWN_MESSAGE" = "To install the updates, you must shut down your computer.";
"UPDATES_DOWNLOADED_INSTALL_AND_SHUTDOWN_INFORMATIVE" = "To finish the installation and shut down your computer, click Shut Down. You will need to press the power button to turn your computer on again.";
"LOG_OUT_AND_INSTALL_AND_SHUTDOWN_TITLE" = "Shut Down";

"NOT_NOW_TITLE" = "Not Now";

// Predicate installs
"DEFAULT_PREDICATE_BLOCKED_MESSAGE" = "When the other update is complete, you can download and install this software by choosing Software Update from the Apple menu.";
"DEFAULT_NO_NETWORK_MESSAGE" = "The next time you're connected to the Internet, you can download and install the software by choosing Software Update from the Apple menu.";
"STANDARD_NO_SUS_MESSAGE" = "Check to make sure your network connection is operating normally. If there are no issues with your connection, contact your network administrator for assistance.";
"NO_UPDATE_FOUND_ERROR" = "The software is currently unavailable.";
